/************************************************************************************

  Copyright (c) 2022,  ...
  All rights reserved.
*************************************************************************************
  File Name    : platform.c
  Author       : xiamj
  Created      : 2022/9/8
  Description  : 

  History      :
  1.Date        : 2022/9/8
    Author      : xiamj
    Modification: Created file

*************************************************************************************/
#ifdef __cplussplus
extern "C"{
#endif /*end ifdef __cplussplus*/

#include "platform.h"
#include <stdio.h>
/*----------------------------------------------------------------------------------*/
/*defines                                                                           */
/*----------------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------------*/
/*extern                                                                            */
/*----------------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------------*/
/*globals                                                                           */
/*----------------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------------*/
/*locals                                                                            */
/*----------------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------------*/
/*funs                                                                              */
/*----------------------------------------------------------------------------------*/


/*************************************************************************************
* 函数名称: cpu_timebase_get 
* 函数说明: 获取系统时间
* 输出参数: 无
* 返 回 值: 返回us
* 备     注: 无
*************************************************************************************/
time_t cpu_timebase_get(void)
{
    time_t val = 0;
    struct timeval time;
    gettimeofday(&time,NULL);
    //printf("sec:%lx %lx.\n",time.tv_sec, time.tv_usec);
    val = time.tv_sec*1000000+time.tv_usec;
    return val;
}

/*************************************************************************************
* 函数名称: cpu_timebase_diff_us 
* 函数说明: 获取last和当前的时间差
* 输入参数: time_t last
* 输出参数: 无
* 返 回 值: 成功返回0，失败返回非0
* 备     注: 无
*************************************************************************************/
time_t cpu_timebase_diff_us(time_t last)
{
    time_t val =cpu_timebase_get();
    return val-last;
}


/*************************************************************************************
* 函数名称: cpu_timebase_diff_ms 
* 函数说明: 获取last和当前的时间差
* 输入参数: time_t last
* 输出参数: 无
* 返 回 值: 成功返回0，失败返回非0
* 备     注: 无
*************************************************************************************/
time_t cpu_timebase_diff_ms(time_t last)
{
    
    return cpu_timebase_diff_us(last)/1000;
}


/*************************************************************************************
* 函数名称: sysMsDelay 
* 函数说明: 毫秒延时
* 输入参数: int ms
* 输出参数: 无
* 返 回 值: 成功返回0，失败返回非0
* 备     注: 无
*************************************************************************************/
void _sysMsDelay(int ms)
{
    time_t val = cpu_timebase_get();
    
    while(cpu_timebase_diff_ms(val)<1000);
}

/*************************************************************************************
* 函数名称: _timeValTest 
* 函数说明: ...
* 输出参数: 无
* 返 回 值: 成功返回0，失败返回非0
* 备     注: 无
*************************************************************************************/
void _timeValTest(void)
{
    time_t timeVal2 = cpu_timebase_get();
    time_t timeVal = cpu_timebase_get();
    printf("timeVal:0x%lx.sizeof(timeVal):%ld\n",timeVal,sizeof(timeVal));
    sysMsDelay(1000);
    timeVal = cpu_timebase_get();
    
    printf("timeVal:0x%lx. diff:%lx\n",timeVal,cpu_timebase_diff_ms(timeVal2));
}

#ifdef __cplussplus
}
#endif /*end ifdef __cplussplus*/

